Autodesk.Revit.DB.Document.CanODBCFileExport
Returns whether ODBC supports export.

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.AXMImportOptions,Autodesk.Revit.DB.View)
Links an AXM file into the document.
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid AXM file.
options:
Various link options applicable to the AXM format. If null, all options will be set to their respective default values.
Link FormIt support Preserve color mode, center-to-center and origin-to-origin placement. Other options are not supported.
Link FormIt does not support this view only option.
Link FormIt does not support import levels.
pDBView:
View used to aid placement of the linked file. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for AXM import (.axm files are valid).
-or-
The provided view is not valid for the options provided.
-or-
Visible layer only option is not false or layers are specified in SetLayerSelection.
-or-
Import levels is not supported for AXM link.
-or-
Not all AXM import option settings are valid. For more details, please refer to AXMImportOptions.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The AXM Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Update(System.String,Autodesk.Revit.DB.ATFXImportOptions)
Updates the current Revit project document which was created by an import of an ATFX file.
file:
Full path of the file to update. File must exist and must be a valid ATFX file.
options:
Various import options applicable to the ATFX format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFX import (.atfxz files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXImportOptions)
Imports an ATFX file into the document.
file:
Full path of the file to import. File must exist and must be a valid ATFX file.
options:
Various import options applicable to the ATFX format. If null, all options will be set to their respective default values.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFX import (.atfxz files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Update(System.String,Autodesk.Revit.DB.FDXImportOptions)
Updates data from a cloud data exchange that was previously imported into the document.
getExchangeUrl:
GET exchanges URL of the file hosting an existing FDX exchange.
options:
Various import options applicable to the Data Exchange format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Options are not valid for the given Document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The FDX Import module is not available in the installed Revit.
Since:
2024

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.FDXImportOptions)
Imports data from cloud data exchange into the document.
getExchangeUrl:
GET exchanges URL of the file hosting an existing FDX exchange.
options:
Various import options applicable to the Data Exchange format. If null, all options will be set to their respective default values.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The FDX Import module is not available in the installed Revit.
Since:
2024

Autodesk.Revit.DB.Document.Update(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Updates the current Revit project document which was created by an import of an ATF XML file.
file:
Full path of the file to update. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFXML import (.atfx files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Imports an ATF XML file into the project document.
file:
Full path of the file to import. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format. If null, all options will be set to their respective default values.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,Autodesk.Revit.DB.FDXExportOptions)
Exports the view specified in the export options to an FDX cloud data exchange.
getExchangesUrl:
GET exchanges URL of the file hosting an existing FDX exchange.
options:
Various options applicable to the FDX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2023

Autodesk.Revit.DB.Document.Export(System.String,Autodesk.Revit.DB.FDXJSONExportOptions)
Exports the view specified in the export options to FDX payload, as a JSON file and associated binary files.
folder:
Output folder into which the files will be exported. The folder must exist.
options:
Various options applicable to the FDX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DirectoryNotEmptyException:
The folder is not empty.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2023

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFXExportOptions)
Exports the document to the ATFX format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the ATFX file to export. If it doesn't end with ".atfxz", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the ATFX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2023

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFXMLExportOptions)
Exports the document to the ATF XML format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the ATF XML file to export. If it doesn't end with ".atfx", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the ATF XML format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2021

Autodesk.Revit.DB.Document.SaveLocalSharedModel(System.Guid,System.Guid,System.String)
After execution, document will represent a local model whose central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectGUID:
Identifies the cloud project to which this model will be attached.
assignedModelGUID:
Identifies the model file on the server
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.WorkshareCloudModel(System.String)
Enables worksharing for this document. Journal messages match saveAsCloudSharedModel
Remarks:
Assumes that user is currently signed in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.SaveAsCloudModel(Autodesk.Revit.DB.ForgeDM.CloudFolder,System.String)
Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs.
Remarks:
Assumes that user is currently signed in BIM 360 Docs or Autodesk Docs and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model in BIM 360 Docs or Autodesk Docs.
If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.  If the local model is a non-workshared model, you can enable the workset with Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String) and then save as a workshared cloud model.  If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs, you can still enable the workset with
Autodesk.Revit.DB.Document.EnableCloudWorksharing to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs.
cloudFolder:
The Folder from ForgeDM to save the model.
modelName:
Model name in BIM 360 Docs or Autodesk Docs to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
modelName is an empty string.
-or-
The input file name "modelName" does not represent a valid file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelMissingException:
Failed due to the region of the input CloudFolder is invalid.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Saving is not allowed in the current application mode.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is a cloud model, cannot be saved as a cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Failed due to the input CloudFolder containing a BIM 360 Docs or Autodesk Docs account Id or project Id is invalid or unmatched.
-or-
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException:
Failed due to there is a model with the same name already exists at the specified location.
Throws Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException:
Failed due to the model name is breaking project naming convention.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You don't have the entitlement to perform the operation to this this Document.
-or-
User is not authorized to access the specified cloud project.
Since:
2022

Autodesk.Revit.DB.Document.IsValidNameForCloudSharedModel(System.String,System.Guid,System.String)
Checks whether there is already a model with the specified name attached to the specified A360 project.
region:
Identifies the account region
projectGUID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
True if there is not already a model with the specified name attached to the specified project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.GetUnitsElementId
Gets the id of the units element (object of UnitsElem) of the Revit units settings
Returns:
The element id of UnitsElem object.
Since:
2021.1

Autodesk.Revit.DB.Document.EraseSchemaAndAllEntities(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Erases Schema and all its Entities from the document.
Remarks:
The Schema remains in memory.
schema:
The Schema to erase.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No write access to this Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Document.ResetSharedCoordinates
Reset shared coordinates for the host model/file.
Remarks:
When you reset shared coordinates, the shared coordinates of the host model will be erased.
The shared relationship with all the linked models will be eliminated.
Survey point will be reset back to startup location, where it coincides with the Internal Origin.
The rotation angle between Project North and True North will be reset back to 0.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021.1

Autodesk.Revit.DB.Document.PublishCoordinates(Autodesk.Revit.DB.LinkElementId)
Publish coordinates to the specified ProjectLocation of the link instance.
Remarks:
The host project's True North and shared origin are recorded in the linked project, based on the current position of the linked instance.
This location is now named in both the host project and the linked project. More than one position of the link can be recorded.
When you publish shared coordinates from a host Revit project to a linked DWG, this changes the linked DWG. The origin of the host Revit
project's shared coordinate system becomes the origin of a new User Coordinate System (UCS) in the DWG file. The Y axis of the new UCS corresponds
to the host project's True North. You can name the UCS when you publish coordinates. It is not recommended that you change this name after
publishing coordinates.
Note: Currently, only RevitLinkInstance is supported. DWG link instance, which is
ImportInstance is not supported now. Passing in an locationId that points to an ImportInstance
would result an ArgumentException.
locationId:
The ElementId of the ProjectLocation in the
linked document, to which the transform would be published to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
locationId does not contain a valid linkInstanceId.
-or-
Only RevitLinkInstance is supported through API for publish coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Attempting to publish shared coordinates to a cloud based link which is treated as read-only.
-or-
Failed to publish coordinates to the specified ProjectLocation of the link instance.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Document.AcquireCoordinates(Autodesk.Revit.DB.ElementId)
Acquires coordinates from the specified link instance.
Remarks:
When you acquire coordinates from the linked model, the shared coordinates of the linked model become the
shared coordinates of the host model, based on the position of the linked model instance in the host model.
There is no change to the host model's internal coordinates.
The host model also acquires True North from the linked model. The origin of the linked model's shared
coordinates becomes the origin of the host model's shared coordinates.
When a Revit model acquires coordinates from a linked DWG file, the World Coordinate System (WCS) of the
selected linked DWG file becomes the shared coordinate system of the host Revit model, based on the position
of the linked DWG instance. The Y axis of the DWG becomes True North, and the origin of the DWG becomes the
origin of the shared coordinate system of the Revit model.
On acquiring coordinates from a geo-referenced model, the geolocation information will be pulled from the linked
model to the host model.
Unlike UI operation Acquire Coordinates, calling the API would always overwrite the geolocation information in the
host model even if it is different from the one in the linked model, or the linked model has empty geolocation information
(in which case the geolocation information in the host model would be removed).
linkInstanceId:
The ElementId of the link instance (such as
RevitLinkInstance or ImportInstance)
from which the coordinates would be acquired.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element linkInstanceId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
The coordinate system of the selected model are the same as the host model.
-or-
Cannot acquire coordinates from a model placed multiple times.
-or-
Failed to acquire coordinates from the link instance.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Document.IsValidVersionGUID(Autodesk.Revit.DB.Document,System.Guid)
Checks whether the GUID is valid for the given document. Empty GUID is allowed.
document:
Target document.
versionGUID:
The GUID to check.
Returns:
True if the GUID is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Document.GetChangedElements(System.Guid)
Extracts a collection containing the ids of elements that have been created, modified or deleted between the input baseVersion and the document's current version.
baseVersionGUID:
GUID of base version(excluded) to compare. This GUID should be retrieved from property Autodesk::Revit::DB::DocumentVersion::VersoinGUID.
Empty GUID is allowed to retrieve changes of each version in the document.
Returns:
An object containing collections of the created, modified and deleted ids between the input version and current version.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This GUID is invalid in the given document.
Since:
2023

Autodesk.Revit.DB.Document.GetDocumentVersion(Autodesk.Revit.DB.Document)
Gets the DocumentVersion that corresponds to a document.
Remarks:
This function can be combined with Autodesk.Revit.DB.Document.IsModified
to see whether a document in memory is different from a version on disk. The documents
are different if the document is modified or if the two DocumentVersions differ.
doc:
The document whose DocumentVersion will be returned.
Returns:
The DocumentVersion corresponding to the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.Delete(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Deletes a set of elements from the document.
Remarks:
This method will delete the elements and any elements that are totally dependent upon that element. Any references to the deleted elements will become invalid and hence cause an exception to be thrown if they are accessed.
The elements will be deleted with no prompts for user confirmation.  Pinned elements will be deleted with no warnings.
Note: in a family document, the predefined elements (those elements inherited from its family template file) can't be deleted by this method.
elementIds:
The ids of the elements to delete.
Returns:
The deleted element id set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in elementIds do not exist in the document.
-or-
One or more of the elementIds cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.Delete(Autodesk.Revit.DB.ElementId)
Deletes an element from the document given the id of that element.
Remarks:
This method will delete the element and any elements that are totally dependent upon that element. Any references to the deleted elements will become invalid and hence cause an exception to be thrown if they are accessed.
The elements will be deleted with no prompts for user confirmation.  Pinned elements will be deleted with no warnings.
Note: in a family document, the predefined elements (those elements inherited from its family template file) can't be deleted by this method.
elementId:
Id of the element to delete.
Returns:
The deleted element id set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
ElementId cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.RemovePaint(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face)
Remove the material painted on the element's face.
If the face is currently not painted,it will do nothing.
elementId:
The element that the painted face belongs to.
face:
The painted element's face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The face doesn't belong to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Document.Paint(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face,Autodesk.Revit.DB.ElementId)
Paint the element's face with specified material.
elementId:
The element that the face belongs to.
face:
The painted element's face.
materialId:
The material to be painted on the face
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The element materialId does not exist in the document
-or-
The face doesn't belong to the element
-or-
The materialId doesn't specify a material element.
-or-
The element's face cannot be painted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Document.GetPaintedMaterial(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face)
Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
elementId:
The element that the face belongs to.
face:
The painted element's face.
Returns:
The material's Id painted on the element's face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The face doesn't belong to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Document.IsPainted(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face)
Checks if the element's face is painted with a material.
elementId:
The element that the face belongs to.
face:
The painted element's face.
Returns:
True if the element's face is painted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The face doesn't belong to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Document.SynchronizeWithCentral(Autodesk.Revit.DB.TransactWithCentralOptions,Autodesk.Revit.DB.SynchronizeWithCentralOptions)
Performs reload latest until the model in the current session is up to date and then saves changes back to central.
A save to central is performed even if no changes were made.
transactOptions:
Options to customize behavior accessing the central model.
syncOptions:
Options to customize behavior of SynchronizeWithCentral.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
-or-
Some of the elements you changed in this model are now editable by someone else, or you checked out worksets that were at risk
or relinquished in the central model but not this file.  You cannot synchronize with the central model until the other user
relinquishes these elements without making changes.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
The local file is read-only.
It can not be saved before or after synchronizing with central.
-or-
This Document is not a workshared document.
-or-
Saving local before first reload latest and after saving changes to central
in Synchronize with Central is mandatory for server-based local models.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be reached
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.HasAllChangesFromCentral
Returns whether the model in the current session is up to date with central.
Returns:
True means up to date; false means out of date.
If central is locked but Revit can determine that
the model in the current session is out of date
without opening central, this method will return false
instead of throwing CentralModelContentionException.
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a workshared document.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.ReloadLatest(Autodesk.Revit.DB.ReloadLatestOptions)
Fetches changes from central (due to one or more synchronizations with central)
and merges them into the current session.
Remarks:
After this call finishes, use hasAllChangesFromCentral to confirm that there were no
Synchronizations with Central performed during execution of ReloadLatest.
reloadOptions:
Various options to control behavior of reloadLatest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a local model: it is not workshared or is central.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Reload Latest was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.GetSubelement(Autodesk.Revit.DB.ElementId,System.Int32)
Gets the subelement referenced by a parent id and subelement id.
Remarks:
null will be returned if the input id string doesn't reference to a valid element or subelement.
id:
Id of the element.
subId:
Id of the sub element.
Returns:
The subelement referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Document.GetSubelement(System.String)
Gets the subelement referenced by a unique id string.
Remarks:
null will be returned if the input id string doesn't reference to a valid element or subelement.
uniqueId:
The unique id that identifies element or subelement.
Autodesk.Revit.DB.Element.UniqueId
Returns:
The subelement referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Document.GetSubelement(Autodesk.Revit.DB.Reference)
Gets the subelement referenced by the input reference.
reference:
The reference that identifies element or subelement.
Returns:
The subelement referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference does not identify a valid element or subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Document.GetElement(Autodesk.Revit.DB.ElementId)
Gets the Element referenced by the input ElementId.
Remarks:
null will be returned if the input ElementId doesn't reference to a valid Element.
id:
The ElementId, whose referenced Element will be retrieved from the model.
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Document.GetElement(System.String)
Gets the Element referenced by a unique id string.
Remarks:
null will be returned if the input id string doesn't reference to a valid Element.
uniqueId:
The element unique id, whose referenced Element will be retrieved from the model.
Autodesk.Revit.DB.Element.UniqueId
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Document.GetElement(Autodesk.Revit.DB.Reference)
Gets the Element referenced by the input reference.
Remarks:
null will be returned if the input reference doesn't reference to a valid Element.
reference:
The reference, whose referenced Element will be retrieved from the model.
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Document.MakeTransientElements(Autodesk.Revit.DB.ITransientElementMaker)
This method encapsulates the process of creating transient elements in the document.
Remarks:
The method establishes a context within which transient elements will be created and then invokes the given maker object to create the elements. For more information refer to the Autodesk.Revit.DB.Element.IsTransient method.
maker:
An instance of a class that implements the  Autodesk.Revit.DB.ITransientElementMaker interface.
The maker will be called to create element(s) which would become transient.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document has an open editing transaction and is accepting changes.
-or-
This Document is read-only: It cannot be modified.

Autodesk.Revit.DB.Document.GetAllUnusedElements(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Returns the list of element ids that are not used. The list of unused element ids may include elements that can't be deleted.
Remarks:
This method returns unused element ids that are available in the Purge Unused window in the Revit, including elements that can't be deleted.
To get unused elements that do not have a category assigned add
Autodesk.Revit.DB.BuiltInCategory.INVALID to the collection of categories.
If the input categories collection is empty, the method returns all unused elements in the document.
categories:
Collection of categories to check for unused elements.
Returns:
Unused element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Document.GetUnusedElements(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Returns the list of element ids that are not used and can be deleted from the document.
Remarks:
This method returns unused element ids that are available in the Purge Unused window in the Revit.
To get unused elements that do not have a category assigned add
Autodesk.Revit.DB.BuiltInCategory.INVALID to the collection of categories.
If the input categories collection is empty, the method returns all unused elements in the document.
categories:
Collection of categories to check for unused elements.
Returns:
Unused elements that can be deleted from the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Document.IsDefaultFamilyTypeIdValid(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks whether the family type id is valid for the give family category.
familyCategoryId:
The family category id.
familyTypeId:
The default family type id.
Returns:
True if the family type id is valid for the give family category, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.SetDefaultFamilyTypeId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the default family type id for the given family category.
familyCategoryId:
The family category id.
familyTypeId:
The default family type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The family type id familyTypeId is invalid for the give family category familyCategoryId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.GetDefaultFamilyTypeId(Autodesk.Revit.DB.ElementId)
Gets the default family type id with the given family category id.
familyCategoryId:
The family category id.
Returns:
The default family type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.IsDefaultElementTypeIdValid(Autodesk.Revit.DB.ElementTypeGroup,Autodesk.Revit.DB.ElementId)
Checks whether the element type id is valid for the give DefaultElmentType id.
defaultTypeId:
The default element type id.
typeId:
The element type id.
Returns:
True if the element type id is valid for the give DefaultElmentType id, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Document.SetDefaultElementTypeId(Autodesk.Revit.DB.ElementTypeGroup,Autodesk.Revit.DB.ElementId)
Sets the default element type id of the given DefaultElementType id.
defaultTypeId:
The default element type id.
typeId:
The element type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element type id typeId is invalid for the give DefaultElementType id defaultTypeId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Document.GetCloudFolderId(System.Boolean)
Gets ForgeDM folder id where the model locates.
Remarks:
It is empty for non-cloud model;
It is cached in Revit model opened session after getting it if forceRefresh is false;
ForgeDM folder id can be changed during Revit model opened session, set forceRefresh as 'true' to get new value.
forceRefresh:
Cached value will be refreshed by sending a service call when forceRefresh is true.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
Thrown when cannot get data from ForgeDM for Revit cloud model.
Since:
2022

Autodesk.Revit.DB.Document.GetProjectId
Gets ForgeDM project id where the model locates.
Remarks:
It is empty for non-cloud model;
It is cached in Revit model opened session after getting it;
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
Thrown when cannot get data from ForgeDM for Revit cloud model.
Since:
2022

Autodesk.Revit.DB.Document.GetHubId
Gets ForgeDM hub id where the model locates. It is cached in session.
Remarks:
It is empty for non-cloud model;
It is cached in Revit model opened session after getting it;
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
Thrown when cannot get data from ForgeDM for Revit cloud model.
Since:
2022

Autodesk.Revit.DB.Document.GetCloudModelUrn
A ForgeDM Urn identifying the model.
Remarks:
It is empty for non-cloud model;
It is cached in Revit model opened session after getting it;
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
Thrown when cannot get data from ForgeDM.
Since:
2022

Autodesk.Revit.DB.Document.GetCloudModelPath
Gets the cloud model path of the cloud model.
Returns:
The cloud model path
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is a not cloud model, cannot execute this operation.
Since:
2019.1

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.GBXMLExportOptions)
Export the model in gbXML (green-building) format.
Remarks:
This export operation will operate on the main EnergyAnalysisDetailModel in the document, if it exists (see EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel()).
If it does not exist, or if the requested ExportEnergyModelType does not match the type of the main EnergyAnalysisDetailModel, this function will fail.
If you need to export a model with different settings or type than the current main energy model in the document, you should delete the current main energy model, update the EnergyAnalysisSettings, and regenerate the energy model.
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
-or-
Analysis type is invalid. For AnalysisMode.ConceptualMasses, use Document.Export(String, String, MassGBXMLExportOptions).
-or-
There is no main EnergyAnalysisDetailModel in the document, or the current main EnergyAnalysisDetailModel is not compatible with the option set in the GBXMLExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
Export is temporarily disabled.

Autodesk.Revit.DB.Document.PostFailure(Autodesk.Revit.DB.FailureMessage)
Posts a failure to be displayed to the user at the end of transaction.
Remarks:
If code inside transaction detects a problem that needs to be communicated to the user,
it should report these conditions via this method. Failures will be validated and possibly
resolved at the end of transaction.
Warnings posted via this method will not be stored in the document after they are resolved.
A unique key returned by postFailure can be stored for the lifetime of transaction and used to
remove failure message if it is no longer relevant.
failure:
The failure to be posted.
Returns:
A unique key that identifies posted failure message in a document. If exactly the same error is posted more than once,
and not removed between the postings, returned key will be the same every time.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Document must be in state of accepting posted failures and the failures must be appropriate
for that current state.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2011

Autodesk.Revit.DB.Document.UnpostFailure(Autodesk.Revit.DB.FailureMessageKey)
Deletes the posted failure message associated with a given FailureMessageKey.
Remarks:
If code that previously has posted a failure is executed again or otherwise detects
that failure conditions do not exist anymore and the failure is not longer relevant,
it should delete a failure message in order to let transaction to be committed.
In order to delete the failure, it should invoke this method with a message key
that was returned when the failure was posted.
messageKey:
The key of the FailureMessage to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
messageKey is invalid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2011

Autodesk.Revit.DB.Document.SaveToProjectAsImage(Autodesk.Revit.DB.ImageExportOptions)
Creates an image view from the currently active view.
options:
The options which govern the image creation.
Returns:
Id of the newly created view if the operation succeeded, invalid element id otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options object is invalid: the ExportRange is invalid, must be CurrentView or VisibleRegionOfCurrentView, or the ViewName is invalid, must be non-empty, unique and should not contain prohibited characters.
-or-
The current view cannot be exported as an image
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.AXMImportOptions,Autodesk.Revit.DB.View)
Imports an AXM file into the document.
file:
Full path of the file to import. File must exist and must be a valid AXM file.
options:
Various import options applicable to the AXM format. If null, all options will be set to their respective default values.
Import FormIt support Preserve color mode, center-to-center and origin-to-origin placement, other options are not supported.
Import FormIt does not support orient to view and this view only option.
pDBView:
View used to aid placement of the imported file. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for AXM import (.axm files are valid).
-or-
The provided view is not valid for the options provided.
-or-
Visible layer only option is not false or layers are specified in SetLayerSelection.
-or-
Import levels is only supported in project document or conceptual mass document for AXM import.
-or-
Not all AXM import option settings are valid. For more details, please refer to AXMImportOptions.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The AXM Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWFImportOptions)
Links Markups in a DWF file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DWF file.
options:
Various link options applicable to the DWF format.
Returns:
A collection of link instance element ids created by the markup link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWF import (.dwf or.dwfx files are valid).
-or-
Some of the views are not importable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DGN file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DGN file.
options:
Various import options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters.
-or-
Visible layer only option must be set to false for DGN import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Imports a DGN file to the document.
file:
Full path of the file to import. File must exist and must be a valid DGN file.
options:
Various options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
elementId:
The id of imported instance after a successful import.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters.
-or-
Visible layer only option must be set to false for DGN import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.ImportOptions3DM,Autodesk.Revit.DB.View)
Links a 3DM file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid 3DM file.
options:
Various import options applicable to the 3DM format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for 3DM import (.3dm files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The 3DM Import/Link module is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ImportOptions3DM,Autodesk.Revit.DB.View)
Imports a 3DM file into the document.
file:
Full path of the file to import. File must exist and must be a valid 3DM file.
options:
Various import options applicable to the 3DM format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for 3DM import (.3dm files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The 3DM Import/Link module is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.STLImportOptions,Autodesk.Revit.DB.View)
Links an STL file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid STL file.
options:
Various import options applicable to the STL format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STL import (.stl files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The STL Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.STLImportOptions,Autodesk.Revit.DB.View)
Imports an STL file into the document.
file:
Full path of the file to import. File must exist and must be a valid STL file.
options:
Various import options applicable to the STL format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STL import (.stl files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The STL Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.OBJImportOptions,Autodesk.Revit.DB.View)
Links an OBJ file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid OBJ file.
options:
Various import options applicable to the OBJ format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for OBJ import (.obj files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The OBJ Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.OBJImportOptions,Autodesk.Revit.DB.View)
Imports an OBJ file into the document.
file:
Full path of the file to import. File must exist and must be a valid OBJ file.
options:
Various import options applicable to the OBJ format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for OBJ import (.obj files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The OBJ Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Links a SKP file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Imports a SKP file into the document.
file:
Full path of the file to import. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Links an SAT file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Imports an SAT file into the document.
file:
Full path of the file to import. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DWG or DXF file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DWG or DXF file.
options:
Various import options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Imports a DWG or DXF file to the document.
file:
Full path of the file to import. File must exist and must be a valid DWG or DXF file.
options:
Various options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
elementId:
The id of imported instance after a successful import.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.PDFExportOptions)
Exports a selection of views in PDF format.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
viewIds:
Selection of ordered views to be exported.
The list must contain at least one valid view.
options:
Various options applicable to the PDF format.
Returns:
True if all specified views are exported successfully,
False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
non empty list of views must be provided.
-or-
NullOrEmpty
-or-
There are duplicate views in viewIds
-or-
some of the views are not printable (exportable).
-or-
Thrown when one or more input arguments are invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Thrown when the target PDF file is inaccessible, e.g. already opened.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.NavisworksExportOptions)
Exports a Revit project to the Navisworks .nwc format.
Remarks:
This is an optional functionality that does not have to be installed. The method "OptionalFunctionalityUtils.isNavisworksExporterAvailable()" can be called to check if the exporter is present.
folder:
The name of the folder for the exported file.
name:
The name of the exported file.  If it doesn't end in '.nwc', this extension will be added automatically.
options:
Options which control the contents of the export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The input options were not valid. Check the exception message for specific details.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
The export operation is cancelled in event handler.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
A Navisworks Exporter is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.OBJExportOptions)
Exports a view specified in the export options to the OBJ format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the OBJ file to export. If it doesn't end with ".obj", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the OBJ format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2023

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.STLExportOptions)
Exports a view specified in the export options to the STL format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the STL file to export. If it doesn't end with ".stl", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the STL format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2021.1

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.IFCExportOptions)
Exports the document to the Industry Standard Classes (IFC) format.
Remarks:
Exporting to IFC requires that document is modifiable, therefore there must be a transaction already open when this method is called.
This method may not be invoked during dynamic update, for the internal routine might need to modify the existing transaction.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
options:
Various options applicable to the IFC format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The IFCExportOptions FamilyMappingFile does not exist.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The IFC module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.SATExportOptions)
Exports the current view or a selection of views in SAT format.
Remarks:
All the views must be 3D views for the Export to succeed.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the SAT format.For now, this option is empty.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
non empty list of views must be provided.
-or-
At least one provided viewId does not correspond to a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DGNExportOptions)
Exports a selection of views in DGN format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
If null, throw ArgumentException.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DGN format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
non empty list of views must be provided.
-or-
some of the views are not printable (exportable).
-or-
Thrown when the options in DGNExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DXFExportOptions)
Exports a selection of views in DXF format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DXF format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
non empty list of views must be provided.
-or-
some of the views are not printable (exportable).
-or-
Thrown when the options in DWGExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DXF module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DWGExportOptions)
Exports a selection of views in DWG format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
If null, throw ArgumentException.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DWG format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
non empty list of views must be provided.
-or-
some of the views are not printable (exportable).
-or-
The modifiers set in layer info must be valid.
-or-
Thrown when the options in DWGExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.ExportImage(Autodesk.Revit.DB.ImageExportOptions)
Exports a view or set of views into an image file.
options:
The options which govern the image export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current view cannot be exported as an image
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The path indicated could not be accessed.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The path indicated could not be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
Failed to export image due to an error with the inputs.
-or-
Failed to export image due to an issue where the DirectX Device was lost.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Graphics module is not available in the installed Revit.
Since:
2011

Autodesk.Revit.DB.Document.EnableCloudWorksharing
Enables cloud worksharing for a cloud model
Remarks:
This operation will convert an existing cloud model to a workshared cloud model.
This method cannot be used if current model is not a cloud model.
This method cannot be used if the current user doesn't have the workshared cloud model entitlement.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the cloud model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The model in cloud is missing.
-or-
The model in cloud is incompatible.
-or-
The model in cloud is corrupt or not an RVT file.
-or-
The model in cloud was rolled back.
-or-
An internal error happened on the model in cloud , please contact the administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local cache.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
The file is read-only, can not be saved.
-or-
The cloud model does not allow cloud worksharing to be enabled.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that conversion fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You do not have workshared cloud model entitlement to access this resource in cloud
-or-
User is not authorized to access the specified cloud project.
Since:
2019.2

Autodesk.Revit.DB.Document.SaveAsCloudModel(System.Guid,System.Guid,System.String,System.String)
Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs.
Remarks:
Assumes that user is currently signed in BIM 360 Docs or Autodesk Docs and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model in BIM 360 Docs or Autodesk Docs.
If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.  If the local model is a non-workshared model, you can enable the workset with Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String) and then save as a workshared cloud model.  If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs, you can still enable the workset with
Autodesk.Revit.DB.Document.EnableCloudWorksharing to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model in BIM 360 Docs or Autodesk Docs.
accountId:
The BIM 360 Docs or Autodesk Docs account Id.
You can use one of the following methods to get this Id:
If you get the hub Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.  If you get the account Id with Forge BIM 360 Docs or Autodesk Docs API, just convert the Id string to a Guid.
projectId:
The BIM 360 Docs or Autodesk Docs project Id.
You can use one of the following methods to get this Id:
If you get the project Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.  If you get the project Id with Forge BIM 360 Docs or Autodesk Docs API, just convert the Id string to a Guid.
folderId:
Folder identity in BIM 360 Docs or Autodesk Docs to save the model.
You can use one of the following methods to get this Id:
The folder Id string from Forge Data Management API.  The folder Id string from Forge BIM 360 Docs or Autodesk Docs API.
modelName:
Model name in BIM 360 Docs or Autodesk Docs to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
folderId is an empty string.
-or-
modelName is an empty string.
-or-
The input file name "modelName" does not represent a valid file name.
-or-
Thrown when the input BIM 360 Docs or Autodesk Docs account Id or project Id is invalid or unmatched.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Saving is not allowed in the current application mode.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is a cloud model, cannot be saved as a cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException:
Failed due to there is a model with the same name already exists at the specified location.
Throws Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException:
Failed due to the model name is breaking project naming convention.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You don't have the entitlement to perform the operation to this this Document.
-or-
User is not authorized to access the specified cloud project.
Since:
2021

Autodesk.Revit.DB.Document.SaveCloudModel
Saves cloud model.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Could be for any of the reasons that related to access to the cloud model.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that fails with CentralModelException, for example, a central model with that name
is already associated to the specified cloud project.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
The file is read-only, can not be saved.
-or-
This Document is a not cloud model, cannot execute this operation.
-or-
This Document is a workshared document.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that save fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Since:
2019.2

Autodesk.Revit.DB.Document.SaveAs(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.SaveAsOptions)
Saves the document to a given path.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
If options.rename is true, then the document's title in Revit's title bar
will be updated automatically to reflect the file's new name.
path:
Name and path to be saved as. For a file path, either a relative or absolute path can be provided.
options:
Options to govern the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is empty.
-or-
The specified filepath is invalid.
-or-
options.PreviewViewId is not valid for generation of a preview.
-or-
The document is not workshared,
so no WorksharingSaveAsOptions are allowed to be set for SaveAs.
-or-
The document just had worksharing enabled or was opened detached,
so WorksharingSaveAsOptions.SaveAsCentral must be set to true for SaveAs.
-or-
Revit cannot clear the transmitted flag. This is not a transmitted document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model. Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Overwrite old-version model is not supported for server-based.
-or-
An internal error happened on the central model, please contact the server administrator.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file at the given path location could not be accessed or saved.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The given file, path or network location could not be found during save.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
options.overwriteExistingFile is 'false' but there is an existing file at path.
-or-
options.overwriteExistingFile is 'true' but the target file at path is read only.
-or-
There is already a central at path; Revit Server does not allow overwrite.
-or-
Revit Server only supports RVT model.
-or-
Saving is not allowed in the current application mode.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
-or-
The file path is invalid.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.Document.SaveAs(System.String,Autodesk.Revit.DB.SaveAsOptions)
Saves the document to a given file path.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
If options.rename is true, then the document's title in Revit's title bar
will be updated automatically to reflect the file's new name.
filepath:
File name and path to be saved as. Either a relative or absolute path can be provided.
options:
Options to govern the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
filepath is an empty string.
-or-
The specified filepath is invalid.
-or-
options.PreviewViewId is not valid for generation of a preview.
-or-
The document is not workshared,
so no WorksharingSaveAsOptions are allowed to be set for SaveAs.
-or-
The document just had worksharing enabled or was opened detached,
so WorksharingSaveAsOptions.SaveAsCentral must be set to true for SaveAs.
-or-
Revit cannot clear the transmitted flag. This is not a transmitted document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file at the given path location could not be accessed or saved.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The given file, path or network location could not be found during save.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
options.overwriteExistingFile is 'false' but there is an existing file at filepath.
-or-
options.overwriteExistingFile is 'true' but the target file at filepath is read only.
-or-
Saving is not allowed in the current application mode.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Revit cannot clear the transmitted flag. This is not a transmitted document.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.SaveAs(System.String)
Saves the document to a given file path.
Remarks:
The document's title in Revit's title bar
will be updated automatically to reflect the file's new name.
filepath:
File name and path to be saved as. Either a relative or absolute path can be provided.
Throws Autodesk.Revit.Exceptions.ArgumentException:
filepath is an empty string.
-or-
The filepath is not a valid file path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file at the given path location could not be accessed or saved.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The given file, path or network location could not be found during save.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
There is an existing file at filepath.
-or-
Saving is not allowed in the current application mode.
-or-
The document just had worksharing enabled or was opened detached,
so SaveAsOptions must be passed in SaveAs
with WorksharingSaveAsOptions.SaveAsCentral set to true.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.Save(Autodesk.Revit.DB.SaveOptions)
Saves the document.
Remarks:
If the document was created in this current session and has not been saved to a file yet,
it needs to be first saved using the SaveAs method instead.
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
options:
Options to control the Save operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options.PreviewViewId is not valid for generation of a preview.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Save may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
Save is temporarily disabled.
-or-
Saving is not allowed in the current application mode.
-or-
File path must be already set to be able to save the document.It needs to be first saved using the SaveAs method instead.
-or-
The file is read-only, can not be saved.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.GetWorksetId(Autodesk.Revit.DB.ElementId)
Get Id of the Workset which owns the element.
Remarks:
Each element belongs to one and only one workset.
id:
Id of the element.
Returns:
Id of the Workset which owns the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String)
Enables worksharing in the document.
Remarks:
The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.
worksetNameGridLevel:
Name of workset for grids and levels.
worksetName:
Name of workset for all other elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
worksetNameGridLevel is an empty string.
-or-
worksetName is an empty string.
-or-
worksetNameGridLevel cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
worksetName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
This Document is in an edit mode.
-or-
This Document is a workshared document.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Enabling worksharing was cancelled.
Since:
2014

Autodesk.Revit.DB.Document.SetUnits(Autodesk.Revit.DB.Units)
Sets the units.
units:
The units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Document.CreationGUID
A unique identifier generated when the Document was first created.
Since:
2024

Autodesk.Revit.DB.Document.IsModifiable
Identifies if the document is modifiable.
Remarks:
This is not a permanent state such as, for example Autodesk.Revit.DB.Document.IsReadOnlyFile.
Value of this property changes dynamically multiple times within the life-time of an open document.
Regardless of the mode a document is opened with, the model can only be modified inside an open transaction.
Furthermore, even with a transaction open, the model is not always modifiable.
Though this is rather a rare situation, it can happen, most likely during model regeneration, failure processing, or some events.
An attempt to modify a non-modifiable document will result in throwing a ModificationOutsideTransactionException.
See also Autodesk.Revit.DB.Document.IsReadOnly

Autodesk.Revit.DB.Document.Title
The document's title.
Remarks:
Title is derived from the document's filename, not including the filename extension.
Note that returned title will be defaulted if no document saved.
Note that returned string may be empty if a document is detached.  See Autodesk.Revit.DB.Document.IsDetached.

Autodesk.Revit.DB.Document.Phases
Retrieves all of the phases in the document.
Remarks:
The phases are returned in order from earliest phase to latest phase.
When Revit is running with UI activated, the default created phase for newly created elements is inherited from the phase of the currently active view.
When Revit is running without its UI, such as when Revit runs on Autodesk Forge Design Automation API for Revit,
the default phase for newly created elements is the latest phase in the document.

Autodesk.Revit.DB.Document.GetTypeOfStorage(Autodesk.Revit.DB.ForgeTypeId)
Get the storage type of the identified built-in parameter.
parameterTypeId: Identifier of the built-in parameter.
Returns: Storage type of the built-in parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since: 2022